

c="'日期','地市','分公司','覆盖类型','网络制式','厂家','eNodeBName','基站名称',\
'基站编号','小区名称','小区编号','下行PRB平均利用率_百分比','上行PRB平均利用率_百分比','PDCCH信道占用率_百分比',\
'PRACH信道占用率_百分比','最大RRC连接用户数','平均RRC连接用户数','平均激活用户数','PDCP层上行流量_MB',\
'PDCP层下行流量_MB','PDCP层总流量_MB','上行PRB资源利用率_业务信息_百分比','上行PRB资源利用率_控制信息_百分比',\
'下行PRB资源利用率_业务信息_百分比','下行PRB资源利用率_控制信息_百分比','空口下行用户面丢包数','空口上行用户面丢包数',\
'平均用户数','用户面下行平均时延_ms','用户面PDCP层上行平均吞吐率_百分比','用户面PDCP层下行平均吞吐率_百分比',\
'物理层上行平均吞吐率_Kbps','物理层下行平均吞吐率_Kbps','UE发起的RRC连接建立请求次数','UE发起的RRC连接建立成功次数',\
'UE发起的RRC连接建立成功率_百分比','UE发起的RRC连接失败次数','网络发起的RRC连接建立请求次数','网络发起的RRC连接建立成功次数',\
'网络发起的RRC连接失败次数','网络发起的RRC建立成功率_百分比','RRC连接建立成功率_百分比','RRC连接重建请求次数','RRC连接重建成功次数',\
'RRC连接重建成功率_百分比','RRC连接建立失败次数_UE无应答','RRC连接建立失败次数_小区Reject','RRC连接建立失败次数_其它原因',\
'E_RAB建立请求次数','E_RAB建立成功次数','E_RAB建立成功率_百分比','无线连接成功率_百分比','E_RAB建立失败次数_UE无响应',\
'E_RAB建立失败次数_核心网问题','E_RAB建立失败次数_传输层问题','E_RAB建立失败次数_无线层问题','E_RAB建立失败次数_无线资源不足',\
'E_RAB建立失败次数_安全模式配置失败','E_RAB建立失败次数_其它原因','E_RAB异常释放次数','E_RAB正常释放次数',\
'E_RAB掉线率_百分比','E_RAB异常释放次数_核心网问题','E_RAB异常释放次数_传输层问题','E_RAB异常释放次数_网络拥塞',\
'E_RAB异常释放次数_切换失败','S1信令连接建立尝试次数','S1信令连接建立成功次数','S1信令连接建立成功率_百分比',\
'eNodeB内切换请求次数','eNodeB内切换成功次数','系统内切换成功率_百分比','eNodeB内切换成功率_百分比','eNodeB间切换成功率_百分比',\
'X2接口切换请求次数','X2接口切换成功次数','X2接口切换成功率_百分比','S1接口切换请求次数','S1接口切换成功次数',\
'S1接口切换成功率_百分比','UE上下文异常释放次数','UE上下文正常释放次数','UE上下文掉线率_百分比','同频切换请求次数',\
'同频切换成功次数','同频切换成功率_百分比','异频切换请求次数','异频切换成功次数','异频切换成功率_百分比','RSSI平均值_dBm',\
'RSSI最大值_dBm','RSSI最小值_dBm','平均每PRB干扰噪声平均值_dBm','信道干扰噪声_dBm','下行双流比_分子','下行双流比_不含单发送天线_百分比',\
'CQI质差比例','CQI0_4次数','LTE重定向到3G的次数','4G重定向3G比例','MR总数','第二强邻区MR重叠覆盖数',\
'精确覆盖率','经度','纬度','参考信号功率','小区发射功率'"

content_arr=c.split(',')
result=[]
print(len(content_arr))
for i in content_arr:
	result.append(i+' FLOAT(13,3)')

finnal_result=','.join(result)
d=finnal_result.replace("\'","")
content=open('content_1.txt',"r+")
content.write(d)
